* 2017
** 2017-07 July
*** 2017-07-21 Friday
**** ON Call
     |----+------+-------+------------------|
     | -2 |   13 | Call  | <2017-07-21 Fri> |
     |----+------+-------+------------------|
     |    | 3.06 | Trade | <2016-12-29 Thu> |
     |----+------+-------+------------------|
     |    | 3.06 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
** 2017-08 August
*** 2017-08-18 Friday
**** ED Call
     |----+------+---------------+------------------|
     | -1 | 77.5 | Call          | <2017-08-18 Fri> |
     |----+------+---------------+------------------|
     |    | 1.88 | Trade         | <2016-12-08 Thu> |
     |    | 1.94 | Roll MAY->AUG | <2017-04-19 Wed> |
     |----+------+---------------+------------------|
     |    | 3.82 |               |                  |
     |----+------+---------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** HD Call
     |----+------+---------------+-------------------|
     | -1 |  145 | Call          | <2017-08-18 Fri>  |
     |----+------+---------------+-------------------|
     |    | 0.64 | Trade         | <2017-01-13 Fri>  |
     |    | 1.19 | Roll MAR->APR | <2017-03-03 Fri>  |
     |    | 1.60 | Roll APR->MAY | <2017-04-03 Mon>  |
     |    | 0.50 | Roll MAY->JUN | <2017-04-19 Wed>  |
     |    | 1.41 | Roll JUN->AUG | <2017-05-24 Wped> |
     |----+------+---------------+-------------------|
     |    | 5.34 |               |                   |
     |----+------+---------------+-------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** QQQ Call
     |----+-------+---------------+------------------|
     | -1 |   134 | Call          | <2017-08-18 Fri> |
     |----+-------+---------------+------------------|
     |    |  2.88 | Trade         | <2017-01-23 Mon> |
     |    |  0.28 |               | <2017-03-06 Mon> |
     |    | -0.16 | Roll APR->MAY | <2017-03-16 Thu> |
     |    |  0.49 | Roll MAY->AUG | <2017-05-11 Thu> |
     |----+-------+---------------+------------------|
     |    |  3.49 |               |                  |
     |----+-------+---------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** QQQ Big Lizard
     |----+-------+-------+------------------|
     | -3 |   138 | Put   | <2017-08-18 Fri> |
     | -3 |   138 | Call  | <2017-08-18 Fri> |
     |  3 |   144 | Call  | <2017-08-18 Fri> |
     |----+-------+-------+------------------|
     |    | 18.88 | Trade | <2017-05-11 Thu> |
     |----+-------+-------+------------------|
     |    | 18.88 |       |                  |
     |----+-------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
